"--------------------------------------------
"   vim設定ファイル
"       各種設定ファイルを呼び出しているだけ。
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.base

"--------------------------------------------
"   ステータスラインの表示設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.statusline

"--------------------------------------------
" 便利なマップ関係
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.keymap

"--------------------------------------------
" 色やカラースキーマの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.color

"--------------------------------------------
" neobundleの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.neobundle

"--------------------------------------------
" neocomplchacheの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.neocomplcache
