"--------------------------------------------
"   vim設定ファイル
"       各種設定ファイルを呼び出しているだけ。
"--------------------------------------------

"--------------------------------------------
" neobundleの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.neobundle

"--------------------------------------------
" 色やカラースキーマの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.color

"--------------------------------------------
" 基本設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.base

"--------------------------------------------
"   カーソル行の設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.cursorline

"--------------------------------------------
"   ステータスラインの表示設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.statusline

"--------------------------------------------
" 便利なマップ関係
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.keymap

"--------------------------------------------
"   [plugin]Unite.vim系の設定 
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.unite

"--------------------------------------------
" [plugin]neocomplchacheの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.neocomplcache

"--------------------------------------------
" [plugin]minibufexplの設定
"--------------------------------------------
source  ~/dotfiles/vim/vimrc.minibufexpl
